Revit 2026 API

# SystemZoneElementTypeDehumidificationSetPoint Property

---

The humidification set point as a number between 0 and 1.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DehumidificationSetPoint { get; set; }
```
```vb
Public Property DehumidificationSetPoint As Double
	Get
	Set
```
```cpp
public:
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
```
```fsharp
member DehumidificationSetPoint : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: |

#### Reference

SystemZoneElementType Class

Autodesk.Revit.DB.Mechanical Namespace